#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortimanager_dvm_cmd_update_device.refreshDevice will be created
  + resource "fortimanager_dvm_cmd_update_device" "refreshDevice" {
      + device         = "FortiGate-VM64-KVM"
      + flags          = [
          + "create_task",
          + "nonblocking",
        ]
      + fmgadom        = "createdByTerraform"
      + force_recreate = (known after apply)
      + id             = (known after apply)
    }

  # fortimanager_exec_workspace_action.lockADOM will be created
  + resource "fortimanager_exec_workspace_action" "lockADOM" {
      + action         = "lockbegin"
      + adom           = "createdByTerraform"
      + force_recreate = (known after apply)
      + id             = (known after apply)
      + scopetype      = "adom"
    }

  # fortimanager_exec_workspace_action.unlockADOM will be created
  + resource "fortimanager_exec_workspace_action" "unlockADOM" {
      + action         = "lockend"
      + adom           = "createdByTerraform"
      + force_recreate = (known after apply)
      + id             = (known after apply)
      + scopetype      = "adom"
    }

  # fortimanager_json_generic_api.authDevice will be created
  + resource "fortimanager_json_generic_api" "authDevice" {
      + id           = (known after apply)
      + json_content = jsonencode(
            {
              + method = "exec"
              + params = [
                  + {
                      + data = {
                          + adom   = "createdByTerraform"
                          + device = {
                              + adm_pass        = ""
                              + adm_usr         = "admin"
                              + "device action" = "promote_unreg"
                              + name            = "FortiGate-VM64-KVM"
                              + platform_str    = "FortiGate-VM64-KVM"
                              + sn              = "FGVMEVDNB1HFA86B"
                            }
                          + flags  = [
                              + "create_task",
                            ]
                        }
                      + url  = "/dvm/cmd/add/device"
                    },
                ]
            }
        )
      + response     = (known after apply)
    }

  # fortimanager_json_generic_api.createADOM will be created
  + resource "fortimanager_json_generic_api" "createADOM" {
      + id           = (known after apply)
      + json_content = jsonencode(
            {
              + method = "add"
              + params = [
                  + {
                      + data = [
                          + {
                              + create_time                = 0
                              + desc                       = "Created By Terraform"
                              + flags                      = [
                                  + "no_vpn_console",
                                ]
                              + log_db_retention_hours     = 1440
                              + log_disk_quota             = 0
                              + log_disk_quota_alert_thres = 90
                              + log_disk_quota_split_ratio = 70
                              + log_file_retention_hours   = 8760
                              + mig_mr                     = 0
                              + mig_os_ver                 = 0
                              + mode                       = "gms"
                              + mr                         = 2
                              + name                       = "createdByTerraform"
                              + os_ver                     = "7.0"
                              + restricted_prds            = "fos"
                              + state                      = 1
                              + uuid                       = ""
                              + workspace_mode             = 1
                            },
                        ]
                      + url  = "/dvmdb/adom"
                    },
                ]
            }
        )
      + response     = (known after apply)
    }

  # fortimanager_json_generic_api.updateDeviceDB will be created
  + resource "fortimanager_json_generic_api" "updateDeviceDB" {
      + id           = (known after apply)
      + json_content = jsonencode(
            {
              + method = "update"
              + params = [
                  + {
                      + data = {
                          + adm_pass      = ""
                          + adm_usr       = "admin"
                          + desc          = "This is updated from Terrafrom using an API!"
                          + latitude      = 60.37309404359674
                          + longitude     = 5.33920881412722
                          + "meta fields" = {
                              + Address                = "Fjøsangerveien 65"
                              + "Company/Organization" = "Eviny Digital AS"
                              + "Contact Email"        = "ghaith.almujalled@verja.no"
                              + "Contact Phone Number" = "+4745402619"
                            }
                          + name          = "authByTerraform"
                        }
                      + url  = "/dvmdb/adom/createdByTerraform/device/FortiGate-VM64-KVM"
                    },
                ]
            }
        )
      + response     = (known after apply)
    }

  # fortimanager_object_cli_template.Edge-Overlay will be created
  + resource "fortimanager_object_cli_template" "Edge-Overlay" {
      + adom        = "createdByTerraform"
      + description = "This is a Terraform example to build a CLI Template"
      + id          = (known after apply)
      + name        = "02-Edge-Overlay"
      + scopetype   = "adom"
      + script      = <<-EOT
            {# 02-Edge-Overlay.j2                                                         #}
            {# Release: 7.2                                                               #}
            {# Design flavor: "BGP on Loopback" (Multi-VRF)                               #}
            {# -------------------------------------------------------------------------- #}
            {# Disclaimer: Normally, this file is not supposed to be edited by users.     #}
            {# -------------------------------------------------------------------------- #}
            
            {% import 'Project' as project with context %}
            
            {% set pe_vrf = project.regions[region].pe_vrf|default(1) %}
            
            {% for h in project.regions[region].hubs %}
            {% set hubloop = loop %}
            {% set ol_tunnels = [] %}
            {% for i in project.profiles[profile].interfaces if i.role == 'wan' and i.name is defined %}
              {# Track generated tunnels, to handle duplicates by adding extra index as a suffix #}
              {% set ul_name = i.ul_name~"-" if i.ul_name is defined else "" %}
              {% set ol_tun = ul_name~"H"~hubloop.index~"_"~i.ol_type %}
              {% set count = ol_tunnels|select("equalto", ol_tun)|list|count %}
              {# Tunnel name = 'H<hub_number>_<ol_type>' if no duplicates, otherwise 'H<hub_number>_<ol_type>_<index>' #}
              {% set ol_tun_name = ol_tun if not count else ol_tun~'_'~(count+1) %}
              {{ ol_tunnels.append(ol_tun) or "" }}
            config vpn ipsec phase1-interface
              edit "{{ ol_tun_name }}"
                set interface "{{ i.name }}"
                set ike-version 2
                {% if project.cert_auth|default(true) %}
                set authmethod signature
                set certificate "{{ project.edge_cert_template|default('Edge') }}"
                {% else %}
                set psksecret {{ project.psk|default('S3cr3t!') }}
                {% endif %}
                set keylife 28800
                set peertype any
                set net-device enable
                set proposal aes256gcm-prfsha256 aes256-sha256
                set idle-timeout enable
                {% if project.intrareg_advpn|default(true) %}
                set auto-discovery-receiver enable
                set add-route disable
                {% else %}
                set auto-discovery-receiver disable    
                set exchange-interface-ip enable
                {% endif %}    
                set encapsulation vpn-id-ipip
                set exchange-ip-addr4 {{ loopback|ipaddr('address') }}
                set network-overlay enable
                set network-id {{ project.hubs[h].overlays[i.ol_type].network_id }}
                set remote-gw {{ project.hubs[h].overlays[i.ol_type].wan_ip }}
                set dpd-retrycount 3
                set dpd-retryinterval 5
                set dpd on-idle
              next
            end
            config vpn ipsec phase2-interface
              edit "{{ ol_tun_name }}"
                set phase1name "{{ ol_tun_name }}"
                set proposal aes256gcm
                set keepalive enable
                set keylifeseconds 3600
              next
            end
            config system interface
              edit "{{ ol_tun_name }}"
                set vrf {{ pe_vrf }}
              next
            end
            {% endfor %}
            {% endfor %}
        EOT
      + type        = "jinja"
      + variables   = (known after apply)
    }

  # fortimanager_object_cli_template.Edge-Routing will be created
  + resource "fortimanager_object_cli_template" "Edge-Routing" {
      + adom        = "createdByTerraform"
      + description = "This is a Terraform example to build a CLI Template"
      + id          = (known after apply)
      + name        = "03-Edge-Routing"
      + scopetype   = "adom"
      + script      = <<-EOT
            {# 03-Edge-Routing.j2                                                         #}
            {# Release: 7.2                                                               #}
            {# Design flavor: "BGP on Loopback" (Multi-VRF)                               #}
            {# -------------------------------------------------------------------------- #}
            {# Disclaimer: Normally, this file is not supposed to be edited by users.     #}
            {# -------------------------------------------------------------------------- #}
            
            {% import 'Project' as project with context %}
            
            {% set pe_vrf = project.regions[region].pe_vrf|default(1) %}
            {% set vrf_rt_as = project.vrf_rt_as|default('65000') %}
            
            config router route-map
              {% for i in range(1,3) %}
              edit "H{{loop.index}}_TAG"
                config rule
                  edit 1
                    set set-tag {{ loop.index }}
                  next
                end
              next
              {% endfor %}
              edit "SLA_OK"
                config rule
                  edit 1
                    set set-community "{{ project.regions[region].as }}:99"
                  next
                end
              next
            end
            
            config router bgp
              set as {{ project.regions[region].as }}
              set router-id {{ loopback|ipaddr('address') }}
              set keepalive-timer 15
              set holdtime-timer 45
              set ibgp-multipath enable
              set recursive-next-hop enable
              set tag-resolve-mode merge
              config neighbor
                {% for h in project.regions[region].hubs %}
                edit {{ project.hubs[h].lo_bgp }}
                  set soft-reconfiguration enable
                  set soft-reconfiguration-vpnv4 enable
                  set advertisement-interval 1
                  set interface "Lo"
                  set update-source "Lo"
                  set connect-timer 1
                  set remote-as {{ project.regions[region].as }}
                  set route-map-in "H{{loop.index}}_TAG"
                  set route-map-in-vpnv4 "H{{loop.index}}_TAG"
                  set route-map-out-vpnv4-preferable "SLA_OK"
                next
                {% endfor %}
              end
              config network
                {% set network_to_advertise = [] %}
                {% for i in project.profiles[profile].interfaces if i.role == 'lan' and i.name is defined and i.advertise|default(true) %}
                  {% if not i.ip in network_to_advertise %}
                    {{ network_to_advertise.append(i.ip) or "" }}
                  {% endif %}
                {% endfor %}
            
                {% for i in network_to_advertise if i|length %}
                  edit {{ loop.index }}
                    set prefix {{ i|ipaddr(0) }}
                  next
                {% endfor %}
                end
              config vrf
                edit "{{ pe_vrf }}"
                  set role pe
                next
                {% for i in project.profiles[profile].interfaces if i.vrf is defined and i.name is defined %}
                edit "{{ i.vrf }}"
                  set role "ce"
                  set rd "{{ vrf_rt_as }}:{{ i.vrf }}"
                  set import-rt "{{ vrf_rt_as }}:{{ i.vrf }}"
                  set export-rt "{{ vrf_rt_as }}:{{ i.vrf }}"
                next
                {% endfor %}
              end
            end
        EOT
      + type        = "jinja"
      + variables   = (known after apply)
    }

  # fortimanager_object_cli_template.Edge-Underlay will be created
  + resource "fortimanager_object_cli_template" "Edge-Underlay" {
      + adom        = "createdByTerraform"
      + description = "This is a Terraform example to build a CLI Template"
      + id          = (known after apply)
      + name        = "01-Edge-Underlay"
      + scopetype   = "adom"
      + script      = <<-EOT
            {# 01-Edge-Underlay.j2                                                        #}
            {# Release: 7.2                                                               #}
            {# Design flavor: "BGP on Loopback" (Multi-VRF)                               #}
            {# -------------------------------------------------------------------------- #}
            {# Disclaimer: Normally, this file is not supposed to be edited by users.     #}
            {# -------------------------------------------------------------------------- #}
            
            {% import 'Project' as project with context %}
            
            {% set pe_vrf = project.regions[region].pe_vrf|default(1) %}
            {% set vrf_leak_summary = project.vrf_leak_summary|default('10.200.255.0/24') %}
            
            {# General settings #}
            config system settings
              set location-id {{ loopback|ipaddr('address') }}
              set allow-subnet-overlap enable
            end
            config system global
              {% if not project.profiles[profile].ha|default(false) and hostname is defined %}
              set hostname {{ hostname }}
              {% endif %}
            end
            
            {# Loop: Configure underlay interfaces #}
            {% for i in project.profiles[profile].interfaces if i.name is defined %}
            config system interface
              edit "{{i.name}}"
                {# IP #}
                {% if i.ip is defined %}
                {% if i.ip == 'dhcp' %}
                set mode dhcp
                {%  else %}
                set mode static
                set ip {{ i.ip }}
                {% endif %}
                {% endif %}
            
                {# VRF #}
                {% if i.vrf is defined %}
                set vrf {{ i.vrf }}
                {% else %}
                set vrf {{ pe_vrf }}
                {% endif %}
            
                {# VLAN #}
                {% if i.vlanid is defined and i.parent is defined %}
                set vdom "root"
                set type vlan
                set vlanid {{ i.vlanid }}
                set interface {{ i.parent }}
                {% endif %}
            
                {# FEX #}
                {% if i.fex|default(false) %}
                set type fext-wan
                {% endif %}       
            
                {# QoS: Add shaping profile and in/outbandwidth only if interface is of type wan and meta fields are both defined #}
                {% if i.role == 'wan' and i.outbandwidth is defined %}
                set estimated-upstream-bandwidth {{ i.outbandwidth }}
                  {% if i.shaping_profile is defined %}
                  set outbandwidth {{ i.outbandwidth }}
                  set egress-shaping-profile {{ i.shaping_profile }}
                  {% endif %}
                {% endif %}
                {% if i.role == 'wan' and i.inbandwidth is defined %}
                set estimated-downstream-bandwidth {{ i.inbandwidth }}
                  {% if i.shaping_profile is defined %}
                  set inbandwidth {{ i.inbandwidth }}
                  set ingress-shaping-profile {{ i.shaping_profile }}
                  {% endif %}
                {% endif %}
            
                {# Other settings #}
                {% if i.role == 'wan' %}
                set role wan
                {% endif %}
                {% if i.role == 'lan' %}
                set role lan
                set device-identification enable
                {% endif %}
                set allowaccess {{ 'ping' if not i.access|default(false) else i.access }}
              next
            end
            
            {# Configure FEX parent interface #}
            {% if i.fex|default(false) %}
            config system interface
              edit {{ i.parent }}
                set mode dhcp
                set allowaccess ping fabric
                set monitor-bandwidth enable
                set role wan
                unset lldp-reception      
              next
            end
            {% endif %}
            
            {# VRF Leak #}
            {% if i.vrf is defined and i.allow_dia|default(false) %}
              {# Configure software vdom-link interface if model is VM #}
              {% if i.leak_npu_link|default('') == '' %}
              config system vdom-link
                edit "vrf{{ i.vrf }}_leak"
                next
              end
              config system interface
                edit "vrf{{ i.vrf }}_leak0"
                  set type vdom-link
                  set vrf {{ pe_vrf }}
                  set vdom 'root'
                  set ip {{ vrf_leak_summary|ipaddr((i.vrf * 2 + 1))|ipaddr('address') }}/31
                  set allowaccess ping
                next
                edit "vrf{{ i.vrf }}_leak1"
                  set type vdom-link
                  set vrf {{ i.vrf }}
                  set vdom 'root'
                  set ip {{ vrf_leak_summary|ipaddr((i.vrf * 2))|ipaddr('address') }}/31
                  set allowaccess ping
                next
              end
              {# Configure vlan interfaces on top of npu link if model is HW #}
              {% else %}
              config system interface
                edit "vrf{{ i.vrf }}_leak0"
                  set type vlan
                  set vlanid {{ 4000 + i.vrf }}
                  set interface "{{i.leak_npu_link}}0"
                  set vrf {{ pe_vrf }}
                  set vdom 'root'
                  set mode static
                  set ip {{ vrf_leak_summary|ipaddr((i.vrf * 2 + 1))|ipaddr('address') }}/31
                  set allowaccess ping
                next
                edit "vrf{{ i.vrf }}_leak1"
                  set type vlan
                  set vlanid {{ 4000 + i.vrf }}
                  set interface "{{i.leak_npu_link}}1"
                  set vrf {{ i.vrf }}
                  set vdom 'root'
                  set mode static
                  set ip {{ vrf_leak_summary|ipaddr((i.vrf * 2))|ipaddr('address') }}/31
                  set allowaccess ping
                next
              end
              {% endif %}
            
              {# Add default route to pe_vrf for each vrf #}
              config router static
                edit {{ 10000 + i.vrf }}
                  set gateway {{ vrf_leak_summary|ipaddr((i.vrf * 2 + 1))|ipaddr('address') }}
                  set device vrf{{ i.vrf }}_leak1
                next
              end
            
              {# Configure a zone for easier policy management of vrf leaking #}
              {% if project.create_vrf_leak_zone|default(true) and i.role == 'lan' %}
              config system zone
                edit "{{ project.pevrf_leak_zone|default('pevrf_leak_zone') }}"
                  append interface "vrf{{ i.vrf }}_leak0"
                next
                edit "{{ project.vrf_leak_zone|default('vrfs_leak_zone') }}"
                  append interface "vrf{{ i.vrf }}_leak1"
                next
              end
              {% endif %}
            {% endif %}
            
            {# End Loop: Configure underlay interfaces #}
            {% endfor %}
            
            {# Main Loopback #}
            config system interface
              edit "Lo"
                set vdom "root"
                set type loopback
                set vrf {{ pe_vrf }}
                set ip {{ loopback|ipaddr('address') }}/32
                set allowaccess ping
              next
            end
            
            {# Create LAN Zone #}
            {% set lan_intf = [] %}
            {% if project.create_lan_zone|default(true) %}
            config system zone
              edit "{{ project.lan_zone|default('lan_zone') }}"
                {% for i in project.profiles[profile].interfaces if i.role == 'lan' and i.name is defined %}
                {{  lan_intf.append(i.name) or "" }}
                {% endfor %}
                set interface {{ lan_intf|join(' ') }}
              next
            end
            {% endif %}
            
            {# Support SD-Branch (Fortilink interface) #}
            {% set fortilink_intf = [] %}
            {% for i in project.profiles[profile].interfaces if i.role == 'sd_branch' and i.name is defined %}
            {{  fortilink_intf.append(i.name) or "" }}
            {% endfor %}
            {% if fortilink_intf %}
            config system global
              set switch-controller enable
            end
            config system interface
              edit "fortilink"
                set member {{ fortilink_intf|join(' ') }}
              next
            end
            {% endif %}
            
            {# Enable DHCP Server on LAN interfaces #}
            {% if project.create_lan_dhcp_server|default(true) %}
            config system dhcp server
              {% for i in project.profiles[profile].interfaces if i.role == 'lan' and i.name is defined %}
              {% if i.dhcp_server|default(true) %}
              edit {{ 10 + loop.index0 }}
                set dns-service default
                set default-gateway {{ i.ip|ipaddr('address') }}
                set netmask {{ i.ip|ipaddr('netmask') }}
                set interface {{ i.name }}
                config ip-range
                  edit 1
                    set start-ip {{ i.ip|ipaddr(4)|ipaddr('address') }}
                    set end-ip {{ i.ip|ipaddr(-5)|ipaddr('address') }}
                  next
                end
              next
              {% endif %}
              {% endfor %}
            end
            {% endif %}
        EOT
      + type        = "jinja"
      + variables   = (known after apply)
    }

  # fortimanager_object_cli_template.Hub-MultiRegion will be created
  + resource "fortimanager_object_cli_template" "Hub-MultiRegion" {
      + adom        = "createdByTerraform"
      + description = "This is a Terraform example to build a CLI Template"
      + id          = (known after apply)
      + name        = "04-Hub-MultiRegion"
      + scopetype   = "adom"
      + script      = <<-EOT
            {# 04-Hub-MultiRegion.j2                                                      #}
            {# Release: 7.2                                                               #}
            {# Design flavor: "BGP on Loopback" (Multi-VRF)                               #}
            {# -------------------------------------------------------------------------- #}
            {# Disclaimer: Normally, this file is not supposed to be edited by users.     #}
            {# -------------------------------------------------------------------------- #}
            
            {% import 'Project' as project with context %}
            
            {% set hub2hub_ol = [] %}
            {% set pe_vrf = project.regions[region].pe_vrf|default(1) %}
            
            {% if project.regions|count > 1  %}
            
            {% for i in project.profiles[profile].interfaces if i.role == 'wan' and i.name is defined %}
              {% for r in project.regions if r != region %}
                {% for h in project.regions[r].hubs %}
                  {% if i.ol_type in project.hubs[h].overlays %}
                  config vpn ipsec phase1-interface
                    edit "{{ r|upper }}_H{{ loop.index}}_{{ i.ol_type }}"
                      set interface "{{ i.name }}"
                      set ike-version 2
                      {% if project.cert_auth|default(true) %}
                      set authmethod signature
                      set certificate "{{ project.edge_cert_template|default('Hub') }}"
                      {% else %}
                      set psksecret {{ project.psk|default('S3cr3t!') }}
                      {% endif %}
                      set keylife 28800
                      set peertype any
                      set proposal aes256gcm-prfsha256
                      {% if project.multireg_advpn|default(false) %}
                      set auto-discovery-sender enable
                      set auto-discovery-receiver enable
                      set auto-discovery-forwarder enable
                      set add-route disable
                      {% else %}
                      set exchange-interface-ip enable
                      {% endif %}
                      set remote-gw {{ project.hubs[h].overlays[i.ol_type].wan_ip }}
                      set encapsulation vpn-id-ipip
                      set exchange-ip-addr4 {{ loopback|ipaddr('address') }}
                      set dpd-retrycount 3
                      set dpd-retryinterval 5
                      set dpd on-idle
                    next
                  end
                  config vpn ipsec phase2-interface
                    edit "{{ r|upper }}_H{{ loop.index}}_{{ i.ol_type }}"
                      set phase1name "{{ r|upper }}_H{{ loop.index}}_{{ i.ol_type }}"
                      set proposal aes256gcm
                      set keepalive enable
                      set keylifeseconds 3600
                    next
                  end
                  config system interface
                    edit "{{ r|upper }}_H{{ loop.index}}_{{ i.ol_type }}"
                      set vrf {{ pe_vrf }}
                    next
                  end
                  {% if project.overlay_stickiness|default(true) %}
                  config router policy
                    edit {{ hub2hub_ol|length * 2 + 11 }}
                      set input-device "EDGE_{{ i.ol_type }}"
                      set output-device "{{ r|upper }}_H{{ loop.index}}_{{ i.ol_type }}"
                      set dst {{ project.lan_summary }}
                    next
                    edit {{ hub2hub_ol|length * 2 + 12 }}
                      set input-device "{{ r|upper }}_H{{ loop.index}}_{{ i.ol_type }}"
                      set output-device "EDGE_{{ i.ol_type }}"
                      set dst {{ project.lan_summary }}
                    next
                  end
                  {% endif %}
                  {{ hub2hub_ol.append(r|upper~'_H'~loop.index~'_'~i.ol_type) or "" }}
                  {% endif %}
                {% endfor %}
              {% endfor %}
            {% endfor %}
            
            {% if project.create_hub2hub_zone|default(true) %}
            config system zone
              edit "{{project.hub2hub_zone|default('hub2hub_overlay')}}"
                append interface {{ hub2hub_ol|join(' ') }}
              next
            end
            {% endif %}
            
            {% if project.multireg_advpn|default(false) %}
            {# Advertise loopback summaries between the regions #}
            config router access-list
              {# Regional loopback summary #}
              edit "LO_REGIONAL_SUMMARY"
                config rule
                  edit 1
                    set prefix {{ project.regions[region].lo_summary }}
                    set exact-match enable
                  next
                end
              next
            end
            config router route-map
              edit "HUB2HUB_OUT"
                config rule
                  edit 1
                    {# Do not readvertise regional loopback summary to remote Edges and other regions #}
                    set match-ip-address "LO_REGIONAL_SUMMARY"
                    set set-community no-advertise
                  next
                  edit 100
                  next
                end
              next
              edit "EDGE_OUT"
                config rule
                  edit 1
                    {# Do not advertise regional loopback summary to Edges (they already receive global summary) #}
                    set match-ip-address "LO_REGIONAL_SUMMARY"
                    set action deny
                  next
                  edit 100
                  next
                end
              next
            end
            config router bgp
              config neighbor-group
                edit "EDGE"
                  set route-map-out EDGE_OUT
                  {# Preserve next-hop of prefixes coming from remote regions #}
                  set attribute-unchanged-vpnv4 next-hop
                next
              end
              config network
                edit 103
                  set prefix {{ project.regions[region].lo_summary }}
                next
              end
            end
            config router static
              edit 103
                set dst {{ project.regions[region].lo_summary }}
                set blackhole enable
                set vrf "{{ pe_vrf }}"
                set comment "Regional loopback summary"
              next
            end
            {% else %}
            {# Advertise regional LAN summaries between the regions #}
            config router static
              {% for v in project.regions[region].vrfs %}
              edit {{ 110 + v.id }}
                set dst {{ v.lan_summary }}
                set blackhole enable
                set vrf "{{ v.id }}"
                set comment "Regional LAN summary (VRF={{ v.id }})"
              next
              {% endfor %}
            end
            config router access-list
              edit "LAN_REGIONAL_SUMMARY"
                config rule
                  {% for v in project.regions[region].vrfs %}
                  edit {{ v.id }}
                    set prefix {{ v.lan_summary }}
                    set exact-match enable
                  next
                  {% endfor %}
                end
              next
            end
            config router route-map
              edit "HUB2HUB_OUT"
                config rule
                  edit 1
                    set match-ip-address "LAN_REGIONAL_SUMMARY"
                    unset set-community
                  next
                  edit 1000
                    set action deny
                  next
                end
              next
            end
            config router bgp
              config redistribute "static"
                set status enable
                set route-map "HUB2HUB_OUT"
              end
            end
            {% endif %}
            
            config router bgp
              config neighbor
                {% for r in project.regions if r != region %}
                {% for h in project.regions[r].hubs %}
                edit {{ project.hubs[h].lo_bgp }}
                  set ebgp-enforce-multihop enable
                  set soft-reconfiguration enable
                  set advertisement-interval 1
                  set link-down-failover enable
                  set interface "Lo"
                  set update-source "Lo"
                  {% if project.multireg_advpn|default(false) %}
                  set attribute-unchanged-vpnv4 next-hop
                  set route-map-out "HUB2HUB_OUT"
                  {% else %}
                  set route-map-out-vpnv4 "HUB2HUB_OUT"
                  {% endif %}
                  set connect-timer 1
                  set remote-as {{ project.regions[r].as }}
                next
                {% endfor %}
                {% endfor %}
              end
            end
            
            {% endif %}
        EOT
      + type        = "jinja"
      + variables   = (known after apply)
    }

  # fortimanager_object_cli_template.Hub-Overlay will be created
  + resource "fortimanager_object_cli_template" "Hub-Overlay" {
      + adom        = "createdByTerraform"
      + description = "This is a Terraform example to build a CLI Template"
      + id          = (known after apply)
      + name        = "02-Hub-Overlay"
      + scopetype   = "adom"
      + script      = <<-EOT
            {# 02-Hub-Overlay.j2                                                          #}
            {# Release: 7.2                                                               #}
            {# Design flavor: "BGP on Loopback" (Multi-VRF)                               #}
            {# -------------------------------------------------------------------------- #}
            {# Disclaimer: Normally, this file is not supposed to be edited by users.     #}
            {# -------------------------------------------------------------------------- #}
            
            {% import 'Project' as project with context %}
            
            {% set pe_vrf = project.regions[region].pe_vrf|default(1) %}
            
            {% for i in project.profiles[profile].interfaces if i.role == 'wan' and i.name is defined %}
            config vpn ipsec phase1-interface
              edit "EDGE_{{ i.ol_type }}"
                set type dynamic
                set interface "{{ i.name }}"
                set ike-version 2
                {% if project.cert_auth|default(true) %}
                set authmethod signature
                set certificate "{{ project.edge_cert_template|default('Hub') }}"
                {% else %}
                set psksecret {{ project.psk|default('S3cr3t!') }}
                {% endif %}
                set peertype any
                set proposal aes256gcm-prfsha256 aes256-sha256
                {% if project.intrareg_advpn|default(true) %}
                set auto-discovery-sender enable
                {% else %}
                set auto-discovery-sender disable
                set exchange-interface-ip enable
                {% endif %}    
                set encapsulation vpn-id-ipip
                set exchange-ip-addr4 {{ loopback|ipaddr('address') }}
                set add-route disable
                set network-overlay enable
                set network-id {{ project.hubs[hostname].overlays[i.ol_type].network_id }}
                set dpd-retrycount 2
                set dpd-retryinterval 5
                set dpd on-idle
              next
            end
            config vpn ipsec phase2-interface
              edit "EDGE_{{ i.ol_type }}"
                set phase1name "EDGE_{{ i.ol_type }}"
                set proposal aes256gcm
                set keepalive enable
              next
            end
            config system interface
              edit "EDGE_{{ i.ol_type }}"
                set vrf {{ pe_vrf }}
              next
            end
            {% endfor %}
        EOT
      + type        = "jinja"
      + variables   = (known after apply)
    }

  # fortimanager_object_cli_template.Hub-Routing will be created
  + resource "fortimanager_object_cli_template" "Hub-Routing" {
      + adom        = "createdByTerraform"
      + description = "This is a Terraform example to build a CLI Template"
      + id          = (known after apply)
      + name        = "03-Hub-Routing"
      + scopetype   = "adom"
      + script      = <<-EOT
            {# 03-Hub-Routing.j2                                                          #}
            {# Release: 7.2                                                               #}
            {# Design flavor: "BGP on Loopback" (Multi-VRF)                               #}
            {# -------------------------------------------------------------------------- #}
            {# Disclaimer: Normally, this file is not supposed to be edited by users.     #}
            {# -------------------------------------------------------------------------- #}
            
            {% import 'Project' as project with context %}
            
            {% set pe_vrf = project.regions[region].pe_vrf|default(1) %}
            {% set vrf_rt_as = project.vrf_rt_as|default('65000') %}
            
            config router community-list
              edit "SLA_OK"
                config rule
                  edit 1
                    set action permit
                    set match "{{ project.regions[region].as }}:99"
                  next
                end
              next
            end
            config router route-map
              edit "LOCAL_REGION"
                config rule
                  edit 1
                    {# Do not advertise to EBGP peers (outside the region #}
                    set set-community "no-export"
                  next
                end
              next
            end
            config router bgp
              set as {{ project.regions[region].as }}
              set router-id {{ loopback|ipaddr('address') }}
              set keepalive-timer 15
              set holdtime-timer 45
              set ibgp-multipath enable
              set ebgp-multipath enable
              set recursive-next-hop enable
              set recursive-inherit-priority enable
              config neighbor-group
                edit "EDGE"
                  set soft-reconfiguration-vpnv4 enable
                  set advertisement-interval 1
                  set next-hop-self enable
                  set remote-as {{ project.regions[region].as }}
                  set interface "Lo"
                  set update-source "Lo"
                  {% if project.intrareg_advpn|default(true) %}
                  set route-reflector-client-vpnv4 enable
                  {% else %}
                  set route-reflector-client-vpnv4 disable
                  {% endif %}      
                next
              end
              config neighbor-range
                edit 1
                  set prefix {{ project.lo_summary }}
                  set neighbor-group "EDGE"
                next
              end
              config network
                edit 1
                  set prefix {{ project.lo_summary }}
                  set route-map "LOCAL_REGION"
                next
                {% set network_to_advertise = [] %}
                {% for i in project.profiles[profile].interfaces if i.role == 'lan' and i.name is defined and i.advertise|default(true) %}
                  {% if not i.ip in network_to_advertise %}
                    {{ network_to_advertise.append(i.ip) or "" }}
                  {% endif %}
                {% endfor %}
            
                {% for i in network_to_advertise if i|length %}
                  edit {{ loop.index + 1 }}
                    set prefix {{ i|ipaddr(0) }}
                  next
                {% endfor %}
                end
              config vrf
                edit "{{ pe_vrf }}"
                  set role pe
                next
                {% for v in project.regions[region].vrfs %}
                edit "{{ v.id }}"
                  set role "ce"
                  set rd "{{ vrf_rt_as }}:{{ v.id }}"
                  set import-rt "{{ vrf_rt_as }}:{{ v.id }}"
                  set export-rt "{{ vrf_rt_as }}:{{ v.id }}"
                next
                {% endfor %}
              end
            end
            
            {% if project.overlay_stickiness|default(true) %}
            config router policy
              {% for i in project.profiles[profile].interfaces if i.role == 'wan' and i.name is defined %}
              edit {{ loop.index }}
                set input-device "EDGE_{{ i.ol_type }}"
                set output-device "EDGE_{{ i.ol_type }}"
                set dst {{ project.lan_summary }}
              next
              {% endfor %}
            end
            {% endif %}
            
            config router static
              edit 101
                set dst {{ project.lan_summary }}
                set blackhole enable
                set vrf "{{ pe_vrf }}"
                set comment "Avoid potential leak of corporate traffic to underlay"
              next
              edit 102
                set dst {{ project.lo_summary }}
                set blackhole enable
                set vrf "{{ pe_vrf }}"
              next
            end
        EOT
      + type        = "jinja"
      + variables   = (known after apply)
    }

  # fortimanager_object_cli_template.Hub-Underlay will be created
  + resource "fortimanager_object_cli_template" "Hub-Underlay" {
      + adom        = "createdByTerraform"
      + description = "This is a Terraform example to build a CLI Template"
      + id          = (known after apply)
      + name        = "01-Hub-Underlay"
      + scopetype   = "adom"
      + script      = <<-EOT
            {# 01-Hub-Underlay.j2                                                         #}
            {# Release: 7.2                                                               #}
            {# Design flavor: "BGP on Loopback" (Multi-VRF)                               #}
            {# -------------------------------------------------------------------------- #}
            {# Disclaimer: Normally, this file is not supposed to be edited by users.     #}
            {# -------------------------------------------------------------------------- #}
            
            {% import 'Project' as project with context %}
            
            {% set pe_vrf = project.regions[region].pe_vrf|default(1) %}
            {% set vrf_leak_summary = project.vrf_leak_summary|default('10.200.255.0/24') %}
            
            {# General settings #}
            config system settings
              set location-id {{ loopback|ipaddr('address') }}
              set tcp-session-without-syn enable  
              set allow-subnet-overlap enable
            end
            config system global
              {% if not project.profiles[profile].ha|default(false) and hostname is defined %}
              set hostname {{ hostname }}
              {% endif %}
            end
            
            {# Loop: Configure underlay interfaces #}
            {% for i in project.profiles[profile].interfaces if i.name is defined %}
            config system interface
              edit "{{i.name}}"
                {# IP #}
                {% if i.ip is defined %}
                {% if i.ip == 'dhcp' %}
                set mode dhcp
                {%  else %}
                set mode static
                set ip {{ i.ip }}
                {% endif %}
                {% endif %}
            
                {# VRF #}
                {% if i.vrf is defined %}
                set vrf {{ i.vrf }}
                {% else %}
                set vrf {{ pe_vrf }}
                {% endif %}
            
                {# VLAN #}
                {% if i.vlanid is defined and i.parent is defined %}
                set vdom "root"
                set type vlan
                set vlanid {{ i.vlanid }}
                set interface {{ i.parent }}
                {% endif %}
            
                {# Other settings #}
                {% if i.role == 'wan' %}
                set role wan
                {% endif %}
                {% if i.role == 'lan' %}
                set role lan
                set device-identification enable
                {% endif %}
                set allowaccess {{ 'ping' if not i.access|default(false) else i.access }}
              next
            end
            
            {# VRF Leak #}
            {% if i.vrf is defined and i.allow_dia|default(false) %}
              {# Configure software vdom-link interface if model is VM #}
              {% if i.leak_npu_link|default('') == '' %}
              config system vdom-link
                edit "vrf{{ i.vrf }}_leak"
                next
              end
              config system interface
                edit "vrf{{ i.vrf }}_leak0"
                  set type vdom-link
                  set vrf {{ pe_vrf }}
                  set vdom 'root'
                  set ip {{ vrf_leak_summary|ipaddr((i.vrf * 2 + 1))|ipaddr('address') }}/31
                  set allowaccess ping
                next
                edit "vrf{{ i.vrf }}_leak1"
                  set type vdom-link
                  set vrf {{ i.vrf }}
                  set vdom 'root'
                  set ip {{ vrf_leak_summary|ipaddr((i.vrf * 2))|ipaddr('address') }}/31
                  set allowaccess ping
                next
              end
              {# Configure vlan interfaces on top of npu link if model is HW #}
              {% else %}
              config system interface
                edit "vrf{{ i.vrf }}_leak0"
                  set type vlan
                  set vlanid {{ 4000 + i.vrf }}
                  set interface "{{i.leak_npu_link}}0"
                  set vrf {{ pe_vrf }}
                  set vdom 'root'
                  set mode static
                  set ip {{ vrf_leak_summary|ipaddr((i.vrf * 2 + 1))|ipaddr('address') }}/31
                  set allowaccess ping
                next
                edit "vrf{{ i.vrf }}_leak1"
                  set type vlan
                  set vlanid {{ 4000 + i.vrf }}
                  set interface "{{i.leak_npu_link}}1"
                  set vrf {{ i.vrf }}
                  set vdom 'root'
                  set mode static
                  set ip {{ vrf_leak_summary|ipaddr((i.vrf * 2))|ipaddr('address') }}/31
                  set allowaccess ping
                next
              end
              {% endif %}
              {# Add a default route to pe_vrf for each vrf #}
              config router static
                edit {{ 10000 + i.vrf }}
                  set gateway {{ vrf_leak_summary|ipaddr((i.vrf * 2 + 1))|ipaddr('address') }}    
                  set device vrf{{ i.vrf }}_leak1
                next
              end
            
              {# Configure a zone for easier policy management of vrf leaking #}
              {% if project.create_vrf_leak_zone|default(true) and i.role == 'lan' %}
              config system zone
                edit "{{ project.pevrf_leak_zone|default('pevrf_leak_zone') }}"
                  append interface "vrf{{ i.vrf }}_leak0"
                next
                edit "{{ project.vrf_leak_zone|default('vrfs_leak_zone') }}"
                  append interface "vrf{{ i.vrf }}_leak1"
                next
              end
              {% endif %}
            {% endif %}
            
            {# End Loop: Configure underlay interfaces #}
            {% endfor %}
            
            {# Loopback for incoming health-check probes #}
            config system interface
              edit "Lo-HC"
                set vdom "root"
                set type loopback
                set vrf {{ pe_vrf }}
                set ip {{ project.hub_hc_server|default('10.200.99.1') }}/32
                set allowaccess ping
              next
              {# Main Loopback #}
              edit "Lo"
                set vdom "root"
                set type loopback
                set vrf {{ pe_vrf }}
                set ip {{ loopback|ipaddr('address') }}/32
                set allowaccess ping
              next
            end
            
            {# Create LAN Zone #}
            {% set lan_intf = [] %}
            {% if project.create_lan_zone|default(true) %}
            config system zone
              edit "{{ project.lan_zone|default('lan_zone') }}"
                {% for i in project.profiles[profile].interfaces if i.role == 'lan' and i.name is defined %}
                {{  lan_intf.append(i.name) or "" }}
                {% endfor %}
                set interface {{ lan_intf|join(' ') }}
              next
            end
            {% endif %}
            
            {# Enable DHCP Server on LAN interfaces #}
            {% if project.create_lan_dhcp_server|default(true) %}
            config system dhcp server
              {% for i in project.profiles[profile].interfaces if i.role == 'lan' and i.name is defined %}
              {% if i.dhcp_server|default(true) %}
              edit {{ 10 + loop.index0 }}
                set dns-service default
                set default-gateway {{ i.ip|ipaddr('address') }}
                set netmask {{ i.ip|ipaddr('netmask') }}
                set interface {{ i.name }}
                config ip-range
                  edit 1
                    set start-ip {{ i.ip|ipaddr(4)|ipaddr('address') }}
                    set end-ip {{ i.ip|ipaddr(-5)|ipaddr('address') }}
                  next
                end
              next
              {% endif %}
              {% endfor %}
            end
            {% endif %}
        EOT
      + type        = "jinja"
      + variables   = (known after apply)
    }

  # fortimanager_object_cli_template.Project will be created
  + resource "fortimanager_object_cli_template" "Project" {
      + adom        = "createdByTerraform"
      + description = "This is a Terraform example to build a project"
      + id          = (known after apply)
      + name        = "Project"
      + scopetype   = "adom"
      + script      = <<-EOT
            {#                            Project Template                                #}
            {# -------------------------------------------------------------------------- #}
            {# This file describes the project: its Regions, Hubs and Device Profiles     #}
            {# Normally, this is the only file that needs to be edited between            #}
            {# different projects                                                         #}
            {# -------------------------------------------------------------------------- #}
            {# Design flavor: "BGP on Loopback" (Multi-VRF)                               #}
            {# Please contact your Fortinet representatives for more details              #}
            
            {#
              Per-device variables used:
              - Required:
                - hostname
                - loopback
                - profile
                - region
                - lan_ip_edu
                - lan_ip_fin
                - mpls_wan_ip (whenever the profile includes MPLS link)
                - mpls_wan_gateway (whenever the profile includes MPLS link)
              - Optional:
                - outbandwidth
                - inbandwidth
                - shaping_profile
            #}
            
            {# Optional Settings #}
            {% set multireg_advpn = true %}
            {% set cert_auth = false %}
            
            {#  Mandatory Global Definitions #}
            {% set lo_summary = '10.200.0.0/14' %}
            {% set lan_summary = '10.0.0.0/8' %}
            
            {# Regions #}
            {% set regions = {
                'West': {
                  'as': '65001',
                  'lo_summary': '10.200.1.0/24',
                  'hubs': [ 'site1-H1', 'site1-H2' ],
                  'vrfs': [
                    {
                      'id': 11,
                      'lan_summary': '10.0.0.0/14'
                    },
                    {
                      'id': 12,
                      'lan_summary': '10.0.0.0/14'
                    }
                  ]
                },
                'East': {
                  'as': '65002',
                  'lo_summary': '10.200.2.0/24',
                  'hubs': [ 'site2-H1' ],
                  'vrfs': [
                    {
                      'id': 11,
                      'lan_summary': '10.4.0.0/14'
                    },
                    {
                      'id': 12,
                      'lan_summary': '10.4.0.0/14'
                    }
                  ]
                }
              }
            %}
            
            {# Device Profiles #}
            {% set profiles = {
            
                'Silver': {
                  'interfaces': [
                    {
                      'name': 'port1',
                      'role': 'wan',
                      'ol_type': 'ISP1',
                      'ip': 'dhcp',
                      'outbandwidth': outbandwidth,
                      'inbandwidth': inbandwidth,
                      'shaping_profile': shaping_profile,
                      'dia': true
                    },
                    {
                      'name': 'port2',
                      'role': 'wan',
                      'ol_type': 'MPLS',
                      'ip': mpls_wan_ip,
                      'outbandwidth': outbandwidth,
                      'inbandwidth': inbandwidth,
                      'shaping_profile': shaping_profile
                    },
                    {
                      'name': 'port3',
                      'role': 'lan',
                      'vrf': 11,
                      'allow_dia': true,
                      'ip': lan_ip_edu
                    },
                    {
                      'name': 'port4',
                      'role': 'lan',
                      'vrf': 12,
                      'ip': lan_ip_fin
                    }
                  ]
                },
            
                'Gold': {
                  'interfaces': [
                    {
                      'name': 'port1',
                      'role': 'wan',
                      'ol_type': 'ISP1',
                      'ip': 'dhcp',
                      'outbandwidth': outbandwidth,
                      'inbandwidth': inbandwidth,
                      'dia': true
                    },
                    {
                      'name': 'port2',
                      'role': 'wan',
                      'ol_type': 'ISP2',
                      'ip': 'dhcp',
                      'outbandwidth': outbandwidth,
                      'inbandwidth': inbandwidth,
                      'dia': true
                    },
                    {
                      'name': 'port3',
                      'role': 'wan',
                      'ol_type': 'MPLS',
                      'ip': mpls_wan_ip,
                      'outbandwidth': outbandwidth,
                      'inbandwidth': inbandwidth
                    },
                    {
                      'name': 'port4',
                      'role': 'lan',
                      'vrf': 11,
                      'allow_dia': true,
                      'ip': lan_ip_edu
                    },
                    {
                      'name': 'port5',
                      'role': 'lan',
                      'vrf': 12,
                      'ip': lan_ip_fin
                    }
                  ]
                }
            
              }
            %}
            
            {# Hubs #}
            {% set hubs = {
            
                'site1-H1': {
                  'lo_bgp': '10.200.1.253',
                  'overlays': {
                    'ISP1': {
                      'wan_ip': '100.64.1.1',
                      'network_id': '11'
                    },
                    'ISP2': {
                      'wan_ip': '100.64.1.9',
                      'network_id': '12'
                    },
                    'MPLS': {
                      'wan_ip': '172.16.1.5',
                      'network_id': '13'
                    }
                  }
                },
            
                'site1-H2': {
                  'lo_bgp': '10.200.1.254',
                  'overlays': {
                    'ISP1': {
                      'wan_ip': '100.64.2.1',
                      'network_id': '21'
                    },
                    'ISP2': {
                      'wan_ip': '100.64.2.9',
                      'network_id': '22'
                    },
                    'MPLS': {
                      'wan_ip': '172.16.2.5',
                      'network_id': '23'
                    }
                  }
                },
            
                'site2-H1': {
                  'lo_bgp': '10.200.2.253',
                  'overlays': {
                    'ISP1': {
                      'wan_ip': '100.64.4.1',
                      'network_id': '41'
                    },
                    'MPLS': {
                      'wan_ip': '172.16.4.5',
                      'network_id': '43'
                    }
                  }
                }
            
              }
            %}
        EOT
      + type        = "jinja"
      + variables   = [
          + "hostname",
          + "inbandwidth",
          + "lan_ip_edu",
          + "lan_ip_fin",
          + "loopback",
          + "mpls_wan_gateway",
          + "mpls_wan_ip",
          + "outbandwidth",
          + "profile",
          + "region",
          + "shaping_profile",
        ]
    }

  # fortimanager_object_cli_templategroup.Edge-Template will be created
  + resource "fortimanager_object_cli_templategroup" "Edge-Template" {
      + adom        = "createdByTerraform"
      + description = "This is a Terraform example to build a CLI template group"
      + id          = (known after apply)
      + member      = [
          + "01-Edge-Underlay",
          + "02-Edge-Overlay",
          + "03-Edge-Routing",
        ]
      + name        = "Edge-Template"
      + scopetype   = "adom"
      + variables   = (known after apply)
    }

  # fortimanager_object_cli_templategroup.Hub-Template will be created
  + resource "fortimanager_object_cli_templategroup" "Hub-Template" {
      + adom        = "createdByTerraform"
      + description = "This is a Terraform example to build a CLI template group"
      + id          = (known after apply)
      + member      = [
          + "01-Hub-Underlay",
          + "02-Hub-Overlay",
          + "03-Hub-Routing",
          + "04-Hub-MultiRegion",
        ]
      + name        = "Hub-Template"
      + scopetype   = "adom"
      + variables   = (known after apply)
    }

  # fortimanager_object_fmg_variable.makeMetadata-hostname will be created
  + resource "fortimanager_object_fmg_variable" "makeMetadata-hostname" {
      + adom                  = "createdByTerraform"
      + dynamic_sort_subtable = "false"
      + id                    = (known after apply)
      + name                  = "hostname"
      + scopetype             = "adom"
      + value                 = "FGT"

      + dynamic_mapping {
          + value = "authByTerraform"

          + _scope {
              + name = "authByTerraform"
              + vdom = "global"
            }
        }
    }

  # fortimanager_object_fmg_variable.makeMetadata-inbandwidth will be created
  + resource "fortimanager_object_fmg_variable" "makeMetadata-inbandwidth" {
      + adom                  = "createdByTerraform"
      + dynamic_sort_subtable = "false"
      + id                    = (known after apply)
      + name                  = "inbandwidth"
      + scopetype             = "adom"
      + value                 = "5"

      + dynamic_mapping {
          + value = "5"

          + _scope {
              + name = "authByTerraform"
              + vdom = "global"
            }
        }
    }

  # fortimanager_object_fmg_variable.makeMetadata-lan_ip_edu will be created
  + resource "fortimanager_object_fmg_variable" "makeMetadata-lan_ip_edu" {
      + adom                  = "createdByTerraform"
      + dynamic_sort_subtable = "false"
      + id                    = (known after apply)
      + name                  = "lan_ip_edu"
      + scopetype             = "adom"
      + value                 = "10.0.0.1/24"

      + dynamic_mapping {
          + value = "10.0.0.1/20"

          + _scope {
              + name = "authByTerraform"
              + vdom = "global"
            }
        }
    }

  # fortimanager_object_fmg_variable.makeMetadata-lan_ip_fin will be created
  + resource "fortimanager_object_fmg_variable" "makeMetadata-lan_ip_fin" {
      + adom                  = "createdByTerraform"
      + dynamic_sort_subtable = "false"
      + id                    = (known after apply)
      + name                  = "lan_ip_fin"
      + scopetype             = "adom"
      + value                 = "11.0.0.1/24"

      + dynamic_mapping {
          + value = "11.0.0.1/24"

          + _scope {
              + name = "authByTerraform"
              + vdom = "global"
            }
        }
    }

  # fortimanager_object_fmg_variable.makeMetadata-loopback will be created
  + resource "fortimanager_object_fmg_variable" "makeMetadata-loopback" {
      + adom                  = "createdByTerraform"
      + dynamic_sort_subtable = "false"
      + id                    = (known after apply)
      + name                  = "loopback"
      + scopetype             = "adom"
      + value                 = "1.1.1.1/32"

      + dynamic_mapping {
          + value = "1.1.1.1/32"

          + _scope {
              + name = "authByTerraform"
              + vdom = "global"
            }
        }
    }

  # fortimanager_object_fmg_variable.makeMetadata-mpls_wan_gateway will be created
  + resource "fortimanager_object_fmg_variable" "makeMetadata-mpls_wan_gateway" {
      + adom                  = "createdByTerraform"
      + dynamic_sort_subtable = "false"
      + id                    = (known after apply)
      + name                  = "mpls_wan_gateway"
      + scopetype             = "adom"
      + value                 = "2.2.2.2/32"

      + dynamic_mapping {
          + value = "2.2.2.2/32"

          + _scope {
              + name = "authByTerraform"
              + vdom = "global"
            }
        }
    }

  # fortimanager_object_fmg_variable.makeMetadata-mpls_wan_ip will be created
  + resource "fortimanager_object_fmg_variable" "makeMetadata-mpls_wan_ip" {
      + adom                  = "createdByTerraform"
      + dynamic_sort_subtable = "false"
      + id                    = (known after apply)
      + name                  = "mpls_wan_ip"
      + scopetype             = "adom"
      + value                 = "12.0.0.1/24"

      + dynamic_mapping {
          + value = "12.0.0.1/24"

          + _scope {
              + name = "authByTerraform"
              + vdom = "global"
            }
        }
    }

  # fortimanager_object_fmg_variable.makeMetadata-outbandwidth will be created
  + resource "fortimanager_object_fmg_variable" "makeMetadata-outbandwidth" {
      + adom                  = "createdByTerraform"
      + dynamic_sort_subtable = "false"
      + id                    = (known after apply)
      + name                  = "outbandwidth"
      + scopetype             = "adom"
      + value                 = "10"

      + dynamic_mapping {
          + value = "10"

          + _scope {
              + name = "authByTerraform"
              + vdom = "global"
            }
        }
    }

  # fortimanager_object_fmg_variable.makeMetadata-profile will be created
  + resource "fortimanager_object_fmg_variable" "makeMetadata-profile" {
      + adom                  = "createdByTerraform"
      + dynamic_sort_subtable = "false"
      + id                    = (known after apply)
      + name                  = "profile"
      + scopetype             = "adom"
      + value                 = "Gold"

      + dynamic_mapping {
          + value = "Gold"

          + _scope {
              + name = "authByTerraform"
              + vdom = "global"
            }
        }
    }

  # fortimanager_object_fmg_variable.makeMetadata-region will be created
  + resource "fortimanager_object_fmg_variable" "makeMetadata-region" {
      + adom                  = "createdByTerraform"
      + description           = "Reagion Variable"
      + dynamic_sort_subtable = "false"
      + id                    = (known after apply)
      + name                  = "region"
      + scopetype             = "adom"
      + value                 = "East"

      + dynamic_mapping {
          + value = "West"

          + _scope {
              + name = "authByTerraform"
              + vdom = "global"
            }
        }
    }

  # fortimanager_object_fmg_variable.makeMetadata-shaping_profile will be created
  + resource "fortimanager_object_fmg_variable" "makeMetadata-shaping_profile" {
      + adom                  = "createdByTerraform"
      + dynamic_sort_subtable = "false"
      + id                    = (known after apply)
      + name                  = "shaping_profile"
      + scopetype             = "adom"
      + value                 = "Silver"

      + dynamic_mapping {
          + value = "Silver"

          + _scope {
              + name = "authByTerraform"
              + vdom = "global"
            }
        }
    }

Plan: 27 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Almujalled, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*